<script setup lang="ts">


import Header from './components/Header.vue';
import Footer from './components/Footer.vue';
import BlockList from './components/blocks/BlockList.vue';
import Block from './components/blocks/Block.vue';
import CommentList from './components/comments/CommentList.vue';
import { useUserStore } from "./stores/profile"
import { useCommentsStore } from './stores/comments';



const user = useUserStore();
const comments = useCommentsStore()
comments.getCommentsFromApi(0, 5, 0)

function getMore() {
  comments.getCommentsFromApi(0, 5, 0)
}
function changeUser(e: Event) {
  user.changeUser(1)
}
</script>

<template>
  <Header></Header>

  <main>
     
    <BlockList>
      <Block>
        <h2>Frontend - разработчик в команду проекта Стажер.online
        </h2>
        <p>Окончание приёма решений: 24.09.2025, 11:23</p>
      </Block>
      <Block>
        <h3>Описание</h3>
        <p>Этот кейс мы подготовили для поиска человека в нашу команду Стажер.online. Задание максимально приближено к
          реальной задаче на платформе: нужно реализовать страницу кейса с комментариями, где будет общение между
          студентами и работодателями.</p>
        <br>
        <p>📌 Необходимо реализовать страницу кейса на Vue 3 с TypeScript, где будет два блока:</p>
        <p>
        <ul>
          <li>Блок комментариев — общение между студентами и работодателями по теме кейса.</li>
          <li>Блок кейса — кейс, похожий на тот, что есть на stazher.online (точное копирование не требуется, можно
            сделать свой вариант по стилю, но с похожей структурой).</li>
        </ul>
        </p>
        <br>
        <p>💬 Требования к блоку комментариев</p>
        <br>
        <ol>
          <li>Поддержка двух ролей: Студент и Работодатель <br>
            <strong>не понял могут ли писать только работадетил создателя тейка поэтому сделал 3 роли,но роль creator можно спокойно заменить на проверку </strong>
          </li>
          <li>В комментарии должны отображаться имя, роль, текст, время публикации и прикреплённые файлы <br>
          <strong>с файлом не лекго было и публикую но там просто стили подправить и будет нормально</strong></li>
          <li>Студенты и работодатели должны различаться визуально (например, цветом, иконкой или лейблом). <br>
         <strong> добавил просто бордер и цвет роли </strong></li>
          <li>Возможность ответить на комментарий (одноуровневая вложенность). <br>
            <strong>
          одноуровняя сложность это прошлый век,очень неудобно и не практично:(</strong></li>
          <li>Возможность прикреплять файлы: изображения с превью, для остальных — иконка и название файла. <br>
          <strong>Использовал сторонию беблиотеку,классная штука этот PQINA</strong></li>
          <li>Возможность ставить реакции эмодзи. <br>
            <strong>сделано </strong>
          </li>
          <li>Валидация: нельзя отправить пустое сообщение. <br>
          <strong>сделано тут объяснять нечего </strong></li>
          <li>Новые комментарии должны появляться без перезагрузки страницы. <br> 
            <strong> сделано с использование pinia</strong></li>
        </ol>
        <br>
        <p>📂 Требования к блоку кейса</p>
        <br>
        <ul>
          <li>Карточка кейса с названием, кратким описание и решениями.</li>
          <li>Структура и визуал должны напоминать оригинал с платформы, но допускается собственный дизайн.</li>
        </ul>
        <br>
        <p>🌟 Дополнительно (плюсом будет)</p>
        <br>
        <ul>
          <li>Подсчёт количества комментариев.</li>
          <li>Кнопка “Показать больше” при большом количестве комментариев.</li>
          <li>Добавить работодателю возможность удалять комментарии в своём кейсе и пожаловаться</li>
          <li>Использование Pinia для управления состоянием.</li>
        </ul>
        <br>
        <p>⚙️ Технические условия</p>
        <ol>
          <li>Использовать Vue 3 + TypeScript.</li>
          <li>Использование SCSS будет плюсом</li>
          <li>Компонентный подход, использование архитектуры FSD будет плюсом</li>
          <li>README файл с описанием структуры проекта, принятых решений и инструкцией для запуска проекта.</li>
        </ol>
        <br>
        <p>В ответе на решение необходимо отправить файл с ссылкой на GitHub/GitLab</p>
      </Block>
      <Block>
        <h3>Награды</h3>
        <p>Награды отсуствуют</p>
      </Block>
      <Block>
        <h3>Решения</h3>
        <p>В процессе...</p>
      </Block>
      <Block>
        <h3>Документы</h3>
        <p><a href="../public/text.txt" target="_blank">Открыть документ</a></p>
      </Block>
      <Block>
        <h4>Кнопкочки переключение пользователей работает только 1 :)</h4>
        <button type="button" @click="changeUser">
          1
        </button><button type="button">
          2
        </button><button type="button">
          3
        </button>
        <button type="button">
          4
        </button>
      </Block>
      <Block>
        <h3>Комментариев всего {{ comments.totalComments }}</h3>
        <CommentList :papa="0" />
        <button type="button" class="btn btn-primary" @click="getMore">Больше</button>
      </Block>
    </BlockList>
  </main>

  <Footer></Footer>
</template>
